ДО_для_разработки/src/Reports/СтруктураСвязейДокумента/СтруктураСвязейДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СтруктураСвязейДокумента</name>
</mdclass:Report>

ДО_для_разработки/src/Documents/ВходящееПисьмо/ВходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящееПисьмо</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдресат</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаПростойТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаРазмеченныйТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДО_для_разработки/src/Documents/ИсходящееПисьмо/ИсходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящееПисьмо</name>
  <basedOn>Catalog.ВнутренниеДокументы</basedOn>
  <basedOn>Catalog.ВходящиеДокументы</basedOn>
  <basedOn>Catalog.ИсходящиеДокументы</basedOn>
  <basedOn>Catalog.ПроектныеЗадачи</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Task.ЗадачаИсполнителя</basedOn>
  <basedOn>Catalog.Мероприятия</basedOn>
  <basedOn>Catalog.Файлы</basedOn>
  <basedOn>Catalog.УведомленияПрограммы</basedOn>
  <basedOn>Document.Отсутствие</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительКонтакт</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ЛичныеАдресаты</types>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтменена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмоОснование</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодготовленоКОтправке</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПисьмаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.СообщенияОбсуждений</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВидаМаршрутизации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДО_для_разработки/src/Reports/СтруктураСвязейДокумента/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;	
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.Сформировать(Результат, Документ, ТипыСвязей, КоличествоУровней);
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") И ЗначениеЗаполнено(Параметры.Документ) Тогда 
		Документ = Параметры.Документ;
		СформироватьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить("Документ");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("Справочник.ВходящиеДокументы", 	НСтр("ru = 'Входящий документ'"));
	СписокВыбора.Добавить("Справочник.ИсходящиеДокументы",  НСтр("ru = 'Исходящий документ'"));
	СписокВыбора.Добавить("Справочник.ВнутренниеДокументы", НСтр("ru = 'Внутренний документ'"));
	СписокВыбора.Добавить("Справочник.Мероприятия", НСтр("ru = 'Мероприятие'"));
	СписокВыбора.Добавить("Справочник.Проекты", НСтр("ru = 'Проект'"));
	СписокВыбора.Добавить("Справочник.Файлы", НСтр("ru = 'Файл'"));
	СписокВыбора.Добавить("Справочник.ШаблоныВнутреннихДокументов", НСтр("ru = 'Шаблон внутреннего документа'"));
	СписокВыбора.Добавить("Справочник.ШаблоныВходящихДокументов", НСтр("ru = 'Шаблон входящего документа'"));
	СписокВыбора.Добавить("Справочник.ШаблоныИсходящихДокументов", НСтр("ru = 'Шаблон исходящего документа'"));
	СписокВыбора.Добавить("Документ.ВходящееПисьмо", НСтр("ru = 'Входящее письмо'"));
	СписокВыбора.Добавить("Документ.ИсходящееПисьмо", НСтр("ru = 'Исходящее письмо'"));
	СписокВыбора.Добавить("Документ.ВходящееСообщениеСВД", НСтр("ru = 'Входящее сообщение СВД'"));
	СписокВыбора.Добавить("Документ.ИсходящееСообщениеСВД", НСтр("ru = 'Исходящее сообщение СВД'"));
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Элемент", Элемент);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ДокументНачалоВыбораПродолжение",
		ЭтотОбъект,
		ПараметрыОповещения);

	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументНачалоВыбораПродолжение(ВыбранныйЭлемент, Параметры) Экспорт 

	Если ВыбранныйЭлемент = Неопределено Тогда 
		Возврат;
	КонецЕсли;	

	Элемент = Параметры.Элемент;
	ИмяТипа = СтрЗаменить(ВыбранныйЭлемент.Значение, "Справочник.", "СправочникСсылка.");
	ИмяТипа = СтрЗаменить(ИмяТипа, "Документ.", "ДокументСсылка.");
	ОписаниеТипа = Новый ОписаниеТипов(ИмяТипа);
	ТекущаяСтрока = ОписаниеТипа.ПривестиЗначение(Документ);
	
	ПараметрыФормы = Новый Структура("ТекущаяСтрока", ТекущаяСтрока);
	Если ВыбранныйЭлемент.Значение = "Справочник.Файлы" Тогда 
		ОткрытьФорму("Справочник.Файлы.Форма.ФормаВыбораФайлаВПапках", ПараметрыФормы, Элемент);
	Иначе	
		ОткрытьФорму(ВыбранныйЭлемент.Значение + ".ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ТипыСвязейОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТипыСвязей.Очистить();
	ТипыСвязей.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ТипыСвязей");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыСвязейНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	Если Не ЗначениеЗаполнено(Документ) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Объект"" не заполнено'"),,"Документ",,);
		Возврат;			
	КонецЕсли;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ТипыСвязейНачалоВыбораПродолжение",
		ЭтотОбъект);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Документ);
	ПараметрыФормы.Вставить("ВыбранныеТипыСвязей", ТипыСвязей);
	
	ОткрытьФорму("Отчет.СтруктураСвязейДокумента.Форма.ВыборТиповСвязи", ПараметрыФормы, ЭтаФорма,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыСвязейНачалоВыбораПродолжение(ВыбранныеТипыСвязей, Параметры) Экспорт 
	
	Если ТипЗнч(ВыбранныеТипыСвязей) = Тип("СписокЗначений") Тогда 
		ТипыСвязей.ЗагрузитьЗначения(ВыбранныеТипыСвязей.ВыгрузитьЗначения());
	КонецЕсли;	

КонецПроцедуры
